---
title: ExportLineweightTableIterator
classe: Autodesk.Revit.DB.ExportLineweightTableIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExportLineweightTableIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyValuePair<ExportLineweightKey, ExportLineweightInfo> Current { get; }` | `exportLineweightTableIterator.Current` | KeyValuePair<ExportLineweightKey, ExportLineweightInfo> |
| `Boolean IsValidObject { get; }` | `exportLineweightTableIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `exportLineweightTableIterator.Dispose()` | Void |
| `Boolean IsDone()` | `exportLineweightTableIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `exportLineweightTableIterator.MoveNext()` | Boolean |
| `Void Reset()` | `exportLineweightTableIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```